Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་གི་ཏིང་ངེ་འཛིན་ཀྱང་བརྒྱད་སྟོང་བཞི་བརྒྱའོ། །
en: Their associated absorptions also number eight thousand four hundred.

source: དེ་དག་གི་རྣམ་པ་ལ་འཇུག་པ་ཡང་སྟོང་སྟོང་སྟེ།
en: Thousands of applications relate to their features,

source: རྣམ་པ་བརྒྱ་བརྒྱ་པོ་རེ་རེའི་སྟོང་སྟོང་པོ་དེས་ན་དེ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཞེས་བྱའོ། །
en: such that for each set of one hundred features there are one thousand applications. Hence, these are known as the eighty-four thousand perfections.

source: དེ་དག་གི་ཏིང་ངེ་འཛིན་བརྒྱད་ཁྲི་བཞི་སྟོང་སྒྲུབ་པར་བྱེད་པ་ནི་བདག་ལ་ཕན་པར་བརྩོན་པ་ཞེས་བྱའོ། །
en: The accomplishment of their eighty-four thousand absorptions is what is known as endeavoring to benefit oneself,

source: གཟུངས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་གཞན་ལ་ཕན་པར་བརྩོན་པ་སྟེ།
en: whereas their eighty-four thousand retentions constitute the endeavor to benefit others.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱིར་དེ་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་བོ། །
en: Because they lead to omniscience, they are the awakening of the buddhas.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ངས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བདུད་བཏུལ་ཏེ། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ང་ཆོས་ལ་དགའ་བའི་རྣམ་པར་སྨིན་པས་ཞག་བདུན་གྱི་བར་དུ་སྐྱིལ་མོ་ཀྲུང་མ་བཤིག་པར་འདུག་པ་ལ་ཚངས་པས་ཀྱེ་མའོ་འཇིག་རྟེན་འདི་ནི་ཆབ་འཚལ་ཏེ
en: “Prāmodyarāja, after I had tamed the māras at the seat of awakening and had awakened to perfect buddhahood, I remained for seven days sitting cross-legged due to the ripening of delight in the Dharma.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱང་ཐུགས་ལས་ཆུང་ངུ་ལ་ཐུགས་མངོན་པར་གཞོལ་བར་མཛད་ཀྱི།
en: At this point, Brahmā came before me and said, ‘The world is lost, for the Thus-Gone One has awakened to perfect buddhahood, which is such a vast Dharma, and yet his mind remains immersed and shows little concern.

source: ཆོས་བསྟན་པའི་སླད་དུ་ནི་མ་ལགས་སོ་ཞེས་གསོལ་བ་བཏབ་བོ། །
en: Was all this not for the sake of teaching the Dharma?’

source: དེ་ནས་ང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་དཔལ་དང་གཟི་བརྗིད་དག་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་མཐོང་ངོ་། །
en: “As I sat upon the seat of awakening, my glory and splendor was noticed by the gods of the pure abodes.

source: ཁ་དོག་དང་ཚུལ་བཟང་པོ་དང་། ཁ་དོག་དུ་མ་སྣང་བ་དང་། སྐུ་དྲང་པོར་བཞུགས་པ་དང་། བཀྲ་ཤིས་པ་དང་། ཐད་དུ་འགྲོ་བར་འོས་པ་དང་། ཀུན་ནས་མཛེས་པ་དང་། ལེགས་པར་གནས་པ་དང་། འོད་ཀྱི་ཁ་དོག་མཆོག་དང་ལྡན་པ་དང་། བལྟ་ན་སྡུག་པ་དང་། བཀོད་པ་ཁྱད་པར་དུ་འཕགས་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། བཀོད་པ་ཡིད་དུ་འོང་བ་དང་། ཡེ་ཤེས་ཀྱི་བདག་ཉིད་ཆེན་པོ་དང་། བལྟ་ན་དཀོན་པ་དང་། གཟི་བྱིན་མཐའ་ཡས་པ་དང་། སྙན་པར་གྲགས་པ་དང་། མཁྱེན་བཞིན་དུ་ཁ་དོག་མཛེས་པར་སྣང་བ་དག་ཀྱང་མཐོང་ནས
en: They saw my fine complexion and demeanor, the many colorful lights, and my upright body. They saw my auspiciousness, attractiveness, exquisiteness, elegant position, colorful radiance, and beauty. They noticed my exceptional array and saw that I surpassed the entire world. They saw my gorgeous array, my great nature of wisdom, which is such a rare sight. They noticed my boundless splendor, my praiseworthy nature, and my wisdom, which were accompanied by beautiful colors.

source: དེའི་ཚེ་སྤྱན་སྔར་འཁོད་དེ་ཞེ་ས་དང་བཅས་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: Thus, they came before me, and respectfully spoke these verses:

source: བདུད་བཏུལ་ཉོན་མོངས་པ་དག་རྣམ་བཅོམ་ཞིང་། །
en: “ ‘You have tamed the māras and crushed the defilements.

source: སྟོང་གསུམ་པོ་ཡི་ས་གཞི་གཡོ་མཛད་ལ། །
en: You make the ground shake throughout the three realms.

source: ངན་སོང་ས་ཡི་སྡུག་བསྔལ་སྤངས་ནས་ཀྱང་། །
en: Having relinquished the suffering of the three lower realms,

source: བྱང་ཆུབ་ཤིང་དྲུང་བཞུགས་པ་ཀུན་དུ་མཛེས། །
en: You are beautiful in all regards, seated by the tree of awakening.

source: ལྷུན་པོ་རི་དང་འདྲ་བར་མི་གཡོ་བར། །
en: “ ‘Immovable like the king of mountains,

source: དྲང་པོའི་སྐུ་ཡིས་བདེ་བར་བཞུགས་མཛད་ལ། །
en: Your upright body is blissful.

source: ཞིང་རྣམས་ཀུན་དུ་འོད་ཟེར་འགྱེད་མཛད་པ། །
en: Filling all realms with your light,

source: མགོན་པོ་ཤིང་དབང་དྲུང་ན་ལྷང་ངེར་བཞུགས། །
en: Protector, you sit resplendent by the king of trees.

source: སྐྱིལ་མོ་ཀྲུང་མཆོག་མཉམ་གཞག་དབང་པོ་ཡིས། །
en: “ ‘With legs crossed in supreme form and your faculties in equipoise,

source: སེང་གེ་ལྟ་བུར་མི་གཡོ་བཞུགས་མཛད་ཅིང་། །
en: You reside like an immutable lion.

source: གོང་ན་མེད་པར་བདག་ཉིད་གཟིགས་པ་ན། །
en: Seeing that there is no one above you,

source: མགོན་པོ་རྒྱལ་བའི་གདན་ལ་ལྷང་ངེར་བཞུགས། །
en: Protector, you sit resplendent on your seat of victory.

source: ངན་སོང་སྲོག་ཆགས་སྡུག་བསྔལ་ཞི་མཛད་ཅིང་། །
en: “ ‘Quelling the suffering of beings in the lower realms

source: མཐོ་རིས་ལམ་དག་རྒྱ་ཆེར་མཛད་པ་ན། །
en: And opening the paths to the higher realms,

source: འཇིག་རྟེན་ལས་མི་འདོད་པ་ཞི་མཛད་པ། །
en: You quell undesirable mundane deeds

source: སཱ་ལའི་མཆོག་དབང་དྲུང་ན་ལྷང་ངེར་བཞུགས། །
en: And sit resplendent by the supreme śāla tree.

source: སྤྱོད་མཉམ་མཉམ་པ་ཉིད་ཀྱིས་བཞུགས་མཛད་ཅིང་། །
en: “ ‘Your conduct is evenhanded and you are settled in equality.

source: འཇིག་རྟེན་ཕན་པར་བདེན་ཚུལ་དགོངས་པ་པོ། །
en: Your concern is for the truth that benefits the world.

source: བདེན་པའི་དབང་ཕྱུག་བསྟན་པ་དགོངས་པ་ན། །
en: As a master of truth and with concern for the teachings,

source: དུས་གསུམ་ཆོས་ཀྱི་དེ་ཉིད་དགོངས་མཛད་ཅིང་། །
en: “ ‘Aware of the suchness of the Dharma throughout the three times,

source: འགྲོ་བ་ཚོགས་གསུམ་དག་ཏུ་མཛད་པ་ན། །
en: You act in the three gatherings of wandering beings.

source: བསྟན་པ་དགོངས་ཚེ་དུས་ཤེས་འདི་དག་ནི། །
en: With concern for the teachings and knowledge of time,

source: ཐུགས་ཆུང་གསུང་བ་ཟླ་བ་ལྷང་ངེར་བཞུགས། །
en: Your focused mind and moon-like speech are resplendent.

source: སེམས་ཅན་མཁས་པ་འཇིག་རྟེན་དམ་པ་སྟེ། །སུམ་ཅུ་གཉིས་མཚན་ལྡན་པ་གཟུགས་མཆོག་མངའ། །
en: “ ‘Your supreme body displays the thirty-two marks Of a wise sentient being, a holy being in the world.

source: དྲང་སྲོང་ཆེན་པོ་འཇིག་རྟེན་མི་སྡུག་པ། །
en: Great sage, in despair about this hideous world,

source: ཚངས་པ་ཡི་ཆད་དངོས་ཀྱིས་ཉེར་མཆིས་ན། །
en: Brahmā has now come before you.

source: མེ་གསུམ་ལྷུང་བའི་འཇིག་རྟེན་གཟིགས་སུ་གསོལ། །
en: “ ‘Please see how the world is plunged into the three fires.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཡན་ལག་གྲུས་བསྟན་གསོལ། །
en: Please reveal the ship of the factors of awakening.

source: མགོན་པོ་བྱང་ཆུབ་ཡན་ལག་བདུན་སྟོན་པ། །
en: Protector, please teach the seven factors of awakening.

source: ཁྱོད་ཀྱིས་བདུད་རྩིའི་ཆར་དབབ་དུས་འདི་ལགས། །
en: Now is the time for you to let the rain of nectar fall.

source: འདུ་ཤེས་ལོག་པ་ལོང་བ་རབ་ཉམས་པའི། །
en: “ ‘With perverse perceptions, blind and depraved,

source: སྐྱེ་དགུ་བདུད་ལམ་གནས་པ་གཟིགས་སུ་གསོལ། །
en: People remain upon the path of the māras—please see this.

source: སྟོན་ཁྱོད་མིག་ལྡན་གཞན་དུ་མི་འགྱུར་བ། །
en: Teacher, there is no one but you who can see.

source: ཁྱོད་ཀྱི་དུས་འདིར་ཐུགས་རྗེ་བསྐྱེད་དུ་གསོལ། །
en: Right now, please give rise to compassion.

source: མུ་སྟེགས་ངན་འགྲོ་གཡང་ས་ཆེན་པོ་ཡི། །སྲིད་པའི་རྒྱ་མཚོས་སྐྱེ་དགུ་འདི་ཁྱེར་རྣམས། །
en: “ ‘People are adrift on the ocean of existence, The great abyss of extremism and the lower realms.

source: སེམས་ཅན་སྲིད་མཚོ་ལས་འདོན་འགྲོ་བའི་དོན། །
en: Please lead them out of the ocean of existence,

source: མཛད་པས་བྱང་ཆུབ་ཡན་ལག་གྲུས་ཀྱང་བསྒྲལ། །
en: Liberating them with the ship of the factors of awakening.

source: འཇིག་ཚོགས་ལྟས་བཅིངས་སྐྱེ་དགུ་འདི་དག་རྣམས། །
en: “ ‘Bound by the view of the aggregates as a person,

source: ལྟ་བས་གནོད་བྱས་སྲིད་པའི་ཁོལ་པོ་དག །
en: People suffer from their views and are slaves of existence.

source: ཡུན་རིང་བགགས་པ་བཅིངས་ལས་ཐར་མ་མཆིས། །
en: For so long they have been held back, tied, and unfree—

source: སེམས་ཅན་ཁ་སྒྱུར་ཅི་སླད་གྲོལ་མི་མཛད། །
en: Why have the guides of beings not freed them?

source: ཉོན་མོངས་དབང་གིས་ལོག་པར་རབ་སོང་ལ། །
en: “ ‘Due to their defilements they remain in error,

source: ཡུན་རིང་གཉིད་ལོག་སྒྲིབ་པས་ཁེབས་པ་རྣམས། །
en: Sleeping for so long, enveloped by their veils.

source: ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་བརྟན་པའི་ཏིང་འཛིན་འཐོབ། །
en: They must attain absorption supported by the practice of spiritual discipline.

source: ཆོས་ཀྱི་རྔ་སྒྲ་ཅི་སླད་བསྒྲགས་མི་བགྱིད། །
en: How can you not beat the drum of the Dharma?

source: འཇིག་རྟེན་དག་ན་དབུལ་གྱུར་འགྲོ་བ་རྣམས། །
en: “ ‘Destitute within the realms of existence,

source: འགྲོ་ལྔ་རེ་ཐག་ཆད་པ་སློང་ཞུགས་ལ། །
en: The five classes of beings are hopeless and blind.

source: ཁྱོད་ཀྱིས་ནོར་བདུན་དེ་རིང་བརྙེས་གྱུར་པས། །
en: Today you have discovered the sevenfold wealth.

source: མཆོད་སྦྱིན་དམ་པ་ཅི་སླད་ད་མི་སྩལ། །
en: How can you not grant them the true gift?

source: བདུད་རྩི་མེད་པའི་སེམས་ཅན་སྟོང་པོ་རྣམས། །
en: “ ‘Sentient beings are destitute, deprived of the nectar.

source: དད་པ་ཕལ་ཆེན་ས་བོན་འཛིན་མཆིས་ན། །
en: But if they possess the seeds of great faith,

source: རྣམ་གྲོལ་གློག་དང་ཐུགས་རྗེའི་ཆར་སྤྲིན་ལས། །
en: Why would you not let the rain of the factors of awakening

source: ཅི་སླད་བྱང་ཆུབ་ཡན་ལག་ཆར་མི་དབབ། །
en: Fall from clouds of compassion with their lightning flashes of liberation?

source: ཟུག་རྔུས་ཟུག་པའི་ནད་པ་ཁམས་གསུམ་ན། །
en: “ ‘In the three realms, beings suffer from painful illness,

source: ཉོན་མོངས་ཉམ་ཐག་ནད་སྙིང་ཟས་ཕོངས་ལ། །
en: Afflicted, miserable, chronically sick, and deprived of sustenance.

source: བྱང་ཆུབ་ཡན་ལག་སྨན་མཆོག་བརྙེས་པ་ཡིས། །
en: You who have obtained the supreme medicine of the factors of awakening,

source: ནད་པ་ཡུན་རིང་དིང་ཅི་གྲོལ་མི་མཛད། །
en: Why would you not today liberate those who have suffered illness for so long?

source: མུན་པ་མུན་ནག་ཞུགས་པའི་འགྲོ་བ་རྣམས། །
en: “ ‘Wandering beings live in dense darkness,

source: གཏི་མུག་བསྒྲིབས་པ་མྱ་ངན་ཆེན་པོའི་ནང་། །
en: Enveloped by ignorance and consumed by despair.

source: སྟོང་ཆེན་ཤེས་རབ་མར་མེས་མུན་ཆེན་པོ། །བཟོད་བརླག་ཅི་ཡི་སླད་དུ་སེལ་མི་མཛད། །
en: How can you not dispel this unbearable darkness With the lamp of insight shining throughout the trichiliocosm?

source: འདམ་རྫབ་ཆུ་བོ་བཞི་ན་ཡོངས་སྐྱོ་བའི། །
en: “ ‘Swept away by the four muddy rivers,

source: སྐྱེ་བོ་གཡང་ས་ཆེན་པོར་ལྷུང་འདི་དག །
en: These distressed beings fall into the abyss.

source: ལྷར་བཅས་འཇིག་རྟེན་སྨན་སླད་ཐུགས་བརྩེ་བའི། །མགོན་པོས་ད་ནི་ཅི་སླད་གདོན་མི་བགྱི། །
en: Loving protector, how can you not now Care for the world and save them?

source: ལྟ་ལ་ཆགས་པའི་མུ་སྟེགས་ཕལ་ཆེན་གྱིས། །
en: “ ‘Due to non-Buddhist hordes who cling to their views,

source: ལྷ་མི་ཀུན་དུ་གློངས་པར་མཆིས་རྣམས་ལ། །
en: Gods and humans remain confused.

source: དྲང་པོ་མ་ཡོ་གཡོ་མེད་བདེ་བ་ཡིས། །
en: With honesty, sincerity, and immutable bliss,

source: ཅི་སླད་རིན་ཆེན་ལམ་དག་ད་མི་བསྟན། །
en: How can you not show them the precious path?

source: མི་དབང་སེང་གེ་ལ་ནི་ཚངས་གསོལ་བས། །
en: “ ‘The leonine ruler of men was beseeched by Brahmā

source: རྫོགས་སངས་རྒྱས་སྤྱན་འཇིག་རྟེན་གསུམ་ལ་གཟིགས། །
en: And the eyes of complete awakening see the three worlds.

source: གཟིགས་ནས་སེམས་ཅན་རྣམས་ལ་བརྩེ་བསྐྱེད་དེ། །
en: As you see them, please have compassion for sentient beings

source: ནད་མེད་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ། །
en: And turn the Dharma wheel of healing.’

source: ལྷ་དེ་དག་གིས་དེ་ལྟར་བརྟགས་ནས་ཀྱང་། །
en: “As the gods spoke these words,

source: བྱང་ཆུབ་སྙིང་པོར་སེང་གདན་ང་འདུག་ལ། །
en: I remained upon the lion seat of awakening.

source: བསྟོད་དེ་བསྟོད་ནས་དེ་ལྟར་དགའ་བས་དོང་། །
en: Continuing their praises, they then joyfully dispersed

source: ངས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །
en: And thereupon, indeed, I turned the wheel of Dharma.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Blessed One had said this, the bodhisattva Prāmodyarāja asked,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་འདུས་པ་འདིའི་ནང་ན་ནི་གང་དག་ཏིང་ངེ་འཛིན་འདི་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འཇུག་པ་འདི་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལ་འཇུག་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་འདི་རྣམས་ཐོབ་པ་དག་མཆིས་ལགས་སམ།
en: “Revered Blessed One, within this gathering of attending bodhisattva great beings, are there any who have attained these absorptions, these applications of the perfections, these eighty-four thousand gateways of absorption?”

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་འདུས་པ་འདིའི་ནང་ན་གང་དག་བསྐལ་པ་བཟང་པོ་འདི་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དག་མ་གཏོགས་པར་གང་དག་ཏིང་ངེ་འཛིན་འདི་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འཇུག་པ་འདི་དག་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལ་འཇུག་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་འདི་དག་ཐོབ་པ་གང་དག་བསྐལ་པ་བཟང་པོ་འདི་ལ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དག་ཡོད་དོ། །
en: “Prāmodyarāja, except for the four thus-gone ones who in this Good Eon have already awakened to perfect buddhahood, all the rest of those who will awaken to perfect buddhahood in this Good Eon are present within this retinue of bodhisattva great beings, and they have attained those absorptions, those applications of the perfections, and those eighty-four thousand gateways of absorption.”

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Prāmodyarāja now replied to the Blessed One,

source: ལེགས་སོ་ལེགས་སོ། །
en: “Wonderful, wonderful!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་
en: Revered Blessed One!

source: སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་དང་། དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བགྱི་བ་དང་།
en: In that way numerous people may be healed and be happy. By showing your love for the world in this way, gods and humans will be successful, healed, and happy, and the sacred Dharma will be protected and remain for a long time.

source: མ་འོངས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྣང་བ་བགྱིད་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱོད་པ་ན་སྒྱིད་ལུག་པར་མི་འགྱུར་བའི་སླད་དུ།
en: In the future, the bodhisattvas will gain understanding and practice without complacency for the sake of unexcelled and perfect awakening.”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་རིགས་དང་། མིང་དེ་དག་བཀའ་སྩལ་དུ་གསོལ།
en: I request that you please state the families and names of those bodhisattvas.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེའི་ཕྱིར་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཚུལ་བཞིན་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Prāmodyarāja, listen very closely and keep my words correctly in mind; I shall explain it to you.”

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་སོ། །ཞེས་གསོལ་ནས་
en: “Blessed One, I shall do so,” answered the bodhisattva Prāmodyarāja, and

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: he listened accordingly.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་མིང་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།། །།
en: The Blessed One now pronounced in verse the names of the thus-gone, worthy, perfect buddhas, as well as the names of the bodhisattvas:

source: འཁོར་བ་འཇིག་དང་གསེར་ཐུབ་དང་། །འོད་སྲུང་ཤཱཀྱ་སྐྱེས་མཆོག་དང་། །བྱམས་པ་སེང་གེ་རབ་གསལ་དང་། །ཐུབ་པ་མེ་ཏོག་ཅེས་བྱ་དང་། །
en: “Krakucchanda, Kanakamuni, Kāśyapa, Supreme of the Śākyas, Maitreya, Siṃha, Pradyota, Muni, and Kusuma.

source: མེ་ཏོག་རྒྱུ་སྐར་བཟང་དེད་དཔོན། །ལག་ཆེན་དང་ནི་སྟོབས་ཆེན་དང་། །རྒྱུ་སྐར་རྒྱལ་པོ་རྩི་སྨན་དང་། །སྙན་པའི་ཏོག་དང་འོད་ཆེན་དང་། །
en: “Kusuma, Sunetra, Sārthavāha, Mahābāhu, Mahābala, Nakṣatrarāja, Oṣadhi, Yaśaketu, and Mahāprabha.

source: གྲོལ་བའི་ཕུང་པོ་ཞེས་བྱ་བའི། །སངས་རྒྱས་ཀྱིས་ནི་སྡེ་ཚན་རྫོགས། །རྣམ་པར་སྣང་མཛད་ཉི་མའི་སྙིང་། །ཟླ་བ་འོད་འཕྲོ་འོད་བཟངས་དང་། །
en: “The buddha Muktiskandha Completes this section. Vairocana, Sūryagarbha, Candra, Arciṣmat, Suprabha,

source: མྱ་ངན་མེད་དང་སྐར་རྒྱལ་དང་། །རབ་གསལ་ཕྲེང་ཐོགས་ཡོན་ཏན་འོད། །དོན་གཟིགས་དང་ནི་མར་མེ་དང་། །མཐུ་ལྡན་སྨན་པ་དེས་པ་དག །
en: Aśoka, Tiṣya. “Pradyota, Mālādhārin, Guṇaprabha, Arthadarśin, Pradīpa, Prabhūta, Vaidya, Sūrata,

source: མཛོད་སྤུ་བརྟན་ལྡན་ལྷ་ཡི་དཔལ། །གདུལ་དཀའ་ཡོན་ཏན་རྒྱལ་མཚན་དང་། །སྒྲ་གཅན་ཚོགས་ལྡན་ཚངས་པའི་དབྱངས། །ཚིགས་བརྟན་དང་ནི་མི་འགྱིང་དང་། །
en: Ūrṇa, Dṛḍha, Śrīdeva, “Duṣpradharṣa, Guṇadhvaja, Rāhu, Gaṇin, Brahmaghoṣa, Dṛḍhasaṃdhi, Anunnata,

source: འོད་མཛད་ལྷུན་པོ་ཆེན་པོ་དང་། །རྡོ་རྗེ་སྡོམ་ཅན་མི་བསྙེངས་དང་། །རིན་ཆེན་པད་སྤྱན་སྟོབས་སྡེ་དང་། །མེ་ཏོག་འོད་ཟེར་ཡེ་ཤེས་དགྱེས། །
en: Prabhaṃkara, Mahāmeru, “Vajra, Sañjayin, Nirbhaya, Ratna, Padmākṣa, Balasena, Kusumaraśmi, Jñānapriya,

source: གཟི་ཆེན་ཚངས་པ་འོད་དཔག་མེད། །ཀླུ་སྦྱིན་དང་ནི་བརྟན་གཤེགས་དང་། །དོན་ཡོད་མཐོང་དང་བརྩོན་འགྲུས་སྦྱིན། །བཟང་སྐྱོང་དགའ་བོ་འཆི་མེད་དང་། །
en: Mahātejas, Brahmā, Amitābha, “Nāgadatta, Dṛḍhakrama, Amoghadarśin, Vīryadatta, Bhadrapāla, Nanda, Acyuta,

source: སེང་གེའི་རྒྱལ་མཚན་རྒྱལ་བ་ཆོས། །མཆོག་དགའ་རྒྱལ་པོ་ཁ་ལོ་སྒྱུར། །དགྱེས་གཤེགས་ཆུ་ལྷ་ཡོན་ཏན་ལག །སྤོས་ཀྱི་གླང་པོ་རྣམ་པར་གཟིགས། །
en: Siṃhadhvaja, Jaya, Dhārmika, “Prāmodyarāja, Sārathi, Priyaṅgama, Varuṇa, Guṇabāhu, Gandhahastin, Vilocana,

source: འབྲུག་སྒྲ་དང་ནི་ལེགས་སེམས་དང་། །ཡིད་བཟངས་དྲི་མེད་ཟླ་བ་དང་། །གྲགས་ཆེན་གཙུག་ན་ནོར་བུ་དང་། །དྲག་ཤུལ་སེང་གེའི་སྟབས་ལྗོན་པ། །
en: Meghasvara, Sucintita, “Sumanas, Vimala, Śaśin, Mahāyaśas, Maṇicūḍa, Ugra, Siṃhagati, Druma,

source: རྣམ་པར་རྒྱལ་ཆེན་ཤེས་རབ་བརྩེགས། །ལེགས་གནས་བློ་གྲོས་ཡན་ལག་སྐྱེས། །བློ་མཐའ་ཡས་དང་གཟུགས་བཟང་དང་། །མཁྱེན་ལྡན་འོད་ཟེར་བརྟུལ་ཞུགས་བརྟན། །
en: Vijitāvin, Prajñākūṭa, “Susthita, Mati, Aṅgaja, Amitabuddhi, Surūpa, Jñānin, Raśmi, Dṛḍhavrata,

source: བཀྲ་ཤིས་དང་ནི་བདེན་པའི་ཏོག །པད་མ་དང་ནི་སྲེད་མེད་བུ། །ལག་བཟངས་ཡེ་ཤེས་འབྱུང་གནས་དང་། །ཡོན་ཏན་འོད་ནི་འཕྲོ་བ་ཡིན། །
en: Maṅgala, Satyaketu, “Padma, Nārāyaṇa, Subāhu, Jñānākara, Guṇārci, Brahmadatta,

source: ཚངས་བྱིན་རིན་ཆེན་འབྱུང་གནས་ལྷ་ཡི་མེ་ཏོག་དང་། །དོན་ལེགས་སེམས་དང་ཆོས་ཀྱི་དབང་ཕྱུག་བློ་གྲོས་པ། །སྤོབས་པ་དག་ནི་བརྩེགས་པ་རྡོ་རྗེའི་རྒྱལ་མཚན་དང་། །བཅུ་པ་སྟོབས་བཅུར་ལྡན་པ་ཕན་པར་བཞེད་པ་ཡིན། །
en: Ratnākara, Kusumadeva, “Sucintitārtha, Dharmeśvara, Yaśomati, Pratibhānakūṭa, Vajradhvaja, The tenth possessor of the ten powers, Hitaiṣin,

source: རྣམ་པར་རོལ་པར་ལྡན་དང་མུན་དང་བྲལ་བ་སྒྲ་གཅན་ལྷ། །རི་བོའི་རྒྱལ་མཚན་ཚོགས་ཅན་འོད་དང་དེ་བཞིན་རིན་ཆེན་སྙིང་། །ཤིན་ཏུ་མཐོར་གཤེགས་དང་ནི་རྒྱལ་བ་སྐར་རྒྱལ་རུ་རིངས་དང་། །བཅུ་པ་ཁམས་གསུམ་མགོན་པོ་ཡོན་ཏན་གྲགས་ཞེས་བྱ་བ་ཡིན། །
en: Vikrīḍitāvin, Vigatatamas, Rāhudeva, “Merudhvaja, Gaṇiprabha, Ratnagarbha, Atyuccagāmin, Tiṣya, Viṣāṇin, the tenth protector of the three realms, Guṇakīrti,

source: ཉི་ཟླ་ཉི་མའི་འོད་དང་སྐར་མཁན་སེང་གེའི་ཏོག་དང་ནི། །དུས་མཁྱེན་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་སྲིད་མཐའ་གཟིགས་པ་དང་། །གློག་གི་འོད་དང་གསེར་གྱི་རི་བོ་སེང་གེས་བྱིན་པ་དང་། །བཅུ་པ་མི་དབང་རྒྱལ་བ་གཞན་གྱིས་མི་ཐུབ་རྒྱལ་མཚན་ཡིན། །
en: Candrārka, Sūryaprabha, Jyotiṣka, Siṃhaketu, “Velāmarāja, Śrīgarbha, Bhavāntadarśin, Vidyutprabha, Kanakaparvata, Siṃhadatta, The tenth victorious lord of men, Aparājita­dhvaja,

source: མཆོག་དགའ་གྲགས་པ་བརྩོན་འགྲུས་བརྟན་པ་དང་ནི་གྲགས་རྫོགས་དང་། །བསྙེངས་བྲལ་དང་ནི་མཆོད་འོས་ལྷ་དང་སྒྲོན་མ་ཆེན་པོ་དང་། །འཇིག་རྟེན་འོད་དང་སྤོས་དྲི་ཞིམ་དང་ཡོན་ཏན་མཆོག་འཛིན་དང་། །བཅུ་པ་རང་བྱུང་མཚུངས་མེད་མུན་དང་རྣམ་པར་བྲལ་བ་ཡིན། །
en: Pramodyakīrti, Dṛḍhavīrya, Saṃpannakīrti, “Vigatabhaya, Arhaddeva, Mahāpradīpa, Lokaprabha, Surabhigandha, Guṇāgradhārin, The tenth self-existing incomparable one, Vigatatamas,

source: སེང་གེའི་འགྲམ་པ་དང་ནི་རིན་ཆེན་གྲགས་དང་སྐྱོན་རབ་ཞི། །བདུད་རྩི་འཆང་དང་མི་ཡི་ཟླ་བ་དང་ནི་ཤིན་ཏུ་གཟིགས། །རབ་ཏུ་བརྒྱན་དང་ནོར་བུ་འོད་དང་རི་བོ་བརྩེགས་པའི་ཏོག །བཅུ་པ་ཆོས་ཀྱི་འབྱུང་གནས་དོན་ངེས་ལྡན་པ་ཡིན། །
en: Siṃhahanu, Ratnakīrti, Praśāntadoṣa, “Amṛtadhārin, Manujacandra, Sudarśana, Pratimaṇḍita, Maṇiprabha, Girikūṭaketu, The tenth, Dharmākara, Arthaviniścita,

source: ཆོས་སྦྱིན་དང་ནི་རིན་ཆེན་འབྱུང་གནས་སྐྱེ་དབང་མཚུངས། །སྟབས་ཀྱིས་གཤེགས་པ་དང་ནི་བློ་གནས་པ་དང་གདུགས་མཛེས་དང་། །གཙོ་བོ་དང་ནི་ཤིན་ཏུ་འཕགས་དཔལ་སེང་གེའི་སྒྲ། །བཅུ་པ་སྐྱེས་བུ་གཙོ་བོ་རྣམ་པར་རོལ་ལྡན་ཡིན། །
en: Harṣadatta, Ratnākara, Janendrakalpa, “Vikrāntagāmin, Sthitabuddhi, Vibhrājacchattra, Jyeṣṭha, Abhyudgataśrī, Siṃhaghoṣa, The tenth leader of beings, Vikrīḍitāvin,

source: ཀླུ་ཡི་འོད་དང་མེ་ཏོག་རི་བོ་དང་ནི་ཀླུ་དགའ་དང་། །སྤོས་ཀྱི་དབང་ཕྱུག་ཤིན་ཏུ་གྲགས་དང་སྟོབས་ལྷ་ཞེས་བྱ་དང་། །ཡོན་ཏན་ཕྲེང་བར་ལྡན་དང་ཀླུ་ཡི་ལག་དང་མིག་བརྒྱན་དང་། །བཅུ་པ་དྲང་སྲོང་ཆེན་པོ་ལེགས་པར་སྦྱངས་པའི་བློ་ཞེས་བྱ། །
en: Nāgaprabhāsa, Kusumaparvata, Nāganandin, “Gandheśvara, Atiyaśas, Baladeva, Guṇamālin, Nāgabhuja, Pratimaṇḍita­locana, The tenth great sage, Sucīrṇabuddhi,

source: ཟིལ་ནོན་ཡེ་ཤེས་མཐའ་ཡས་སྤྱན་དང་བདེན་པར་གསུང་བ་དང་། །ཉི་མའི་འོད་དང་ངེས་པའི་བློ་དང་མཐའ་ཡས་པ་ཡི་གཟུགས། །རྣམ་པར་སྣང་མཛད་རིན་ཆེན་ཏོག་དང་ཐེ་ཚོམ་སྤངས་པ་དང་། །བཅུ་པ་རང་ཉིད་བྱུང་བ་འཇིག་རྟེན་དག་ལས་འདས་པ་ཡིན། །
en: Jñānābhibhū, Amitalocana, Satyabhāṇin, “Sūryaprabha, Niyatabuddhi, Anantarūpa, Vairocana, Ratnaketu, Vigatakāṅkṣa, The tenth self-arising one, Lokottīrṇa,

source: དོན་ཡོད་རྣམ་པར་གནོན་དང་རྟོག་མཛད་མེ་ཏོག་རྒྱལ་མཚན་དང་། །རི་དབང་རྒྱལ་པོ་དང་ནི་གཟི་བརྗིད་ཆེ་དང་དོན་མཛད་གཟིགས། །གྲགས་པ་མཐའ་ཡས་དང་ནི་རིན་ཆེན་ལྷ་དང་དོན་གནས་མཁྱེན། །བཅུ་པ་བློ་ནི་ཡོངས་སུ་རྫོགས་པ་དམན་མིན་གྲགས་པ་ཡིན། །
en: Amoghavikramin, Vibodhana, Puṣpaketu, “Śailendrarāja, Mahātejas, Kṛtārthadarśin, Amitayaśas, Ratnadeva, Sthitārtha­jñānin, The tenth one of matchless renown, Pūrṇamati,

source: མྱ་ངན་མེད་ཅེས་བྱ་དང་དྲི་མ་བྲལ་དང་ཚངས་ལྷ་དང་། །ས་ཡི་དབང་ཕྱུག་མེ་ཏོག་སྤྱན་དང་རྣམ་པར་འབྱེས་པའི་སྐུ། །ཆོས་ཀྱི་འོད་དང་ཀུན་ནི་གཟིགས་དང་ཡོན་ཏན་འོད་གསལ་དང་། །བཅུ་པ་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད་པ་དྲི་མེད་ཟླ་བའི་ཞལ། །
en: Aśoka, Vigatamala, Brahmadeva, “Dharaṇīśvara, Kusumanetra, Vibhaktagātra, Dharmaprabhāsa, Nikhiladarśin, Guṇaprabhāsa, The tenth one worshiped by the three worlds, stainless Śaśivaktra,

source: རིན་ཆེན་འོད་དང་རིན་ཆེན་ཏོག་དང་ནི། །གྲགས་བླ་འོད་བྱེད་གཟི་བརྗིད་དཔག་མེད་དང་། །དུས་མཁྱེན་སེང་གེའི་སྐུ་དང་མཁས་བློ་དང་། །རྒྱལ་བར་དཀའ་དང་ཡོན་ཏན་ཕུང་པོ་དང་། །
en: Ratnaprabha, Ratnaketu, “Yaśottara, Prabhākara, Amitatejas, Velāma, Siṃhagātra, Vidumati, Durjaya, Guṇaskandha,

source: ཟླ་བའི་ཏོག་དང་མཐུ་ནི་ཐོབ་པ་དང་། །མཐུ་རྩལ་མཐའ་ཡས་ཟླ་བ་དྲི་མེད་དང་། །དོན་རྣམས་ཐམས་ཅད་གཟིགས་དང་དཔའ་བོ་དང་། །འབྱོར་པར་ལྡན་དང་བསོད་ནམས་སྒྲོན་མ་དང་། །
en: Śaśiketu, Sthāmaprāpta, “Anantavikrāmin, Candra, Vimala, Sarvārtha­darśin, Śūra, Samṛddha, Puṇya, Pradīpa,

source: ཡོན་ཏན་འོད་འཕྲོ་བློ་ནི་ཡངས་པ་དང་། །ལེགས་སྐྱེས་ནོར་ལྷ་ཡིད་གཉིས་སྤོང་བ་དང་། །འཛིན་པ་དཔག་མེད་མཆོག་སྲེད་ཆོམས་མེད་དང་། །མི་གནས་པ་དང་སངས་རྒྱས་དེར་གནས་དང་། །
en: Guṇārci, Vipulabuddhi, “Sujāta, Vasudeva, Vimatijaha, Amitadhara, Vararuci, Anihata, Asthita, the buddha Tacchaya,

source: ཚོགས་ཅན་གཙོ་བོ་འགྲོ་བའི་འོད་ཟེར་དང་། །ཕལ་ཆེན་རྒྱལ་དང་གཟི་བརྗིད་མཐའ་ཡས་དང་། །དོན་གྱི་བློ་གྲོས་སྨན་པའི་རྒྱལ་པོ་དང་། །ཐ་བ་སྤངས་དང་རིམས་མེད་ལེགས་བྱིན་དང་། །
en: Gaṇimukha, Jagadraśmi, “Prabhūta, Puṣya, Anantatejas, Arthamati, Vaidyarāja, Prahāṇakhila, Nirjvara, Sudatta,

source: གྲགས་བྱིན་མེ་ཏོག་བྱིན་དང་སྐྱེས་བུས་བྱིན། །རྡོ་རྗེ་སྡེ་དང་ཕལ་ཆེན་བྱིན་པ་དང་། །ཞི་བའི་བློ་གྲོས་སྤོས་ཀྱི་གླང་པོ་དང་། །སྲེད་མེད་བུ་དང་དེས་པ་མི་ཚུགས་པ། །
en: Yaśadatta, Kusumadatta, Puruṣadatta, “Vajrasena, Mahādatta, Śāntimati, Gandhahastin, Nārāyaṇa, Sūrata, Anihata,

source: ཉི་ཟླ་གློག་གི་ཏོག་དང་མཆོད་པ་དང་། །དཔལ་སྦས་དང་ནི་ཡེ་ཤེས་ཉི་མ་དང་། །དོན་གྲུབ་ལྷུན་པོ་བརྩེགས་དང་དགྲ་འདུལ་དང་། །པད་མ་དང་ནི་དགྲ་བཅོམ་གྲགས་པ་ཡིན། །
en: Candrārka, Vidyutketu, Mahita, “Śrīgupta, Jñānasūrya, Siddhārtha, Merukūṭa, Aridama, Padma, Arthakīrti,

source: ཡེ་ཤེས་འགྲོས་དང་ཉོན་མོངས་བྲལ་བ་དང་། །འདམ་བུ་དང་ནི་སྤོས་བཟངས་ཡུལ་འཁོར་རངས། །ལྷ་གྲགས་སྲིད་མཐའ་གཟིགས་དང་ཟླ་བ་དང་། །སྒྲ་གཅན་དང་ནི་རིན་ཆེན་ཟླ་བ་དང་། །
en: Jñānakrama, Apagatakleśa, “Nala, Sugandha, Anupamarāṣṭra, Marudyaśas, Bhavāntadarśin, Candra, Rāhu, Ratnacandra,

source: སེང་གེའི་རྒྱལ་མཚན་དང་ནི་བསམ་གཏན་དགྱེས། །རྫོགས་ལྡན་རྣམ་རོལ་ཡོན་ཏན་རིན་ཆེན་དང་། །དགྲ་བཅོམ་གྲགས་པ་པད་ངོས་མཛོད་སྤུ་ལྡན། །སྤོབས་པ་གྲགས་པ་རྡོ་རྗེ་ནོར་བུ་དང་། །
en: Siṃhadhvaja, Dhyānarata, “Anupama, Vikrīḍita, Guṇaratna, Arhadyaśas, Padmapārśva, Ūrṇāvat, Pratibhāna­kīrti, Maṇivajra,

source: ཚེ་དཔག་མེད་དང་ནོར་བུ་བཀོད་པ་དང་། །དབང་ཆེན་ཡོན་ཏན་འབྱུང་གནས་ལྷུན་པོ་གྲགས། །འོད་ཟེར་བཅུ་པ་མ་སྨད་གླང་པོའི་འགྲོས། །ཡིད་དུ་འཐད་པ་རིན་ཆེན་ཟླ་བ་དང་། །
en: Amitāyus, Maṇivyūha, “Mahendra, Guṇākara, Meruyaśas, Daśaraśmi, Anindita, Nāgakrama, Manoratha, Ratnacandra,

source: ཞི་བ་རབ་གསལ་རྒྱལ་པོ་ཁ་ལོ་སྒྱུར། །དགའ་བའི་དབང་ཕྱུག་གཙུག་ན་རིན་པོ་ཆེ། །བསྙེངས་བྲལ་རིན་ཆེན་སྙིང་པོ་ཟླ་བའི་ཞལ། །དྲི་མ་མེད་གྲགས་ཞི་བའི་གཟི་བརྗིད་དང་། །
en: Śānta, Pradyotarāja, Sārathi, “Nandeśvara, Ratnacūḍa, Vigatabhaya, Ratnagarbha, Ratnacandra, Vimalakīrti, Śāntatejas,
